{"data":{"site":{"siteMetadata":{"title":"Violentmonkey","subtitle":"An open source userscript manager.","copyright":"© All rights reserved.","author":{"name":"Gerald L.","twitter":"gera2ld"},"disqusShortname":"","url":"https://violentmonkey.github.io/"}},"markdownRemark":{"id":"d4df257c-211a-5e8e-9a22-1277e63fe543","html":"<p>For anyone who uses Violentmonkey, it is easy to find a way to edit a script like this:</p>\n<p><img src=\"/editor-1-52e07bc04265f6628af77e2ed266053e.png\"></p>\n<p>However, it is really hard to make everyone love it. <em>A</em> probably likes a theme of <code class=\"language-text\">monokai</code>, while <em>B</em> prefers <code class=\"language-text\">eclipse</code>. <em>C</em> might use 2 spaces for indentation while <em>D</em> prefers tabs.</p>\n<p>It is impossible to satisfy every single user. Lots of configurations may be added for this, but are they really worth it? A user would have to face lots of choices before he could use it just as a script manager, or have to look for a simple option among lots of unrelated editor options. What is worse, the browser may inhibit some shortcuts or operations that a local editor can have. In other words, an editor inside Violentmonkey will never be as good as your favorite one.</p>\n<p>Here comes the question: How to edit my script with my favorite editor?</p>\n<h2>Save to a file</h2>\n<p>First, copy the script to your favorite editor and save it to a file.</p>\n<p><img src=\"/editor-2-17a5d02e3af9acd5c40e180192fa9e07.png\"></p>\n<p>VIM is my favorite editor, and the script is saved at <code class=\"language-text\">D:/Source/vm-script.user.js</code>. Note that the script file must have a name ending with <code class=\"language-text\">.user.js</code>, otherwise won't be recognized by Violentmonkey.</p>\n<h2>Install a local script</h2>\n<p>First make sure the local script is named with a suffix of <code class=\"language-text\">.user.js</code>.</p>\n<p>There are two ways to install a local script:</p>\n<ul>\n<li>\n<p><em>Easy way:</em> drag the file into the browser.</p>\n<p>It will be recognized by Violentmonkey and loaded in the confirmation page.</p>\n<p>Make sure <em>\"Allow access to file URLs\"</em> is checked in your <em>Chrome extension settings</em> (<code class=\"language-text\">chrome://extensions</code>).</p>\n<p><img src=\"/editor-6-bf23974b6eeaef641a71bf08d1f2dd1c.png\"></p>\n</li>\n<li>\n<p><em>Hard way:</em> start a local HTTP server, then open the local script with a URL like <code class=\"language-text\">http://localhost:8080/my-script.user.js</code>.</p>\n<p>If you have Python 3 installed, just type <code class=\"language-text\">python3 -m http.server</code> at the directory of your script to start a server.</p>\n<p>Make sure the hostname is <code class=\"language-text\">localhost</code> and the script name ends with <code class=\"language-text\">.user.js</code>.</p>\n</li>\n</ul>\n<p>Note that due to a <a href=\"#Known-issues\">known issue</a>, the <em>easy way</em> <strong>won't work for Firefox users</strong>.</p>\n<p><img src=\"/editor-3-661dce4756c0ba64899cbb919da56f8b.png\"></p>\n<p>Make sure the <code class=\"language-text\">track local file</code> option is checked and then confirm installation.</p>\n<p><img src=\"/editor-4-c24d0bc496b005979d19eb4d4d6db0b5.png\"></p>\n<h2>Edit and sync</h2>\n<p>After installation, the confirmation page will keep watching the file before the page is closed. Once the file is changed, the new version will be installed automatically. As a result, you edit the script in your favorite editor, and the changes are synced to Violentmonkey immediately.</p>\n<p><img src=\"/editor-5-421f4c24f117d74eacd0208b1870bfb9.png\"></p>\n<h2>Known issues</h2>\n<ul>\n<li>In Firefox Violentmonkey is not allowed to access local files, so we have to start a local HTTP server for tracking. See <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=1266960\">this on bugzilla</a>.</li>\n</ul>","fields":{"tagSlugs":["/tags/editor/","/tags/crx/","/tags/nex/","/tags/oex/","/tags/mx/"]},"frontmatter":{"title":"How to edit scripts with your favorite editor?","tags":["editor","crx","nex","oex","mx"],"date":"2017-03-14T14:37:09.000Z","description":""}}},"pageContext":{"slug":"/2017/03/14/How-to-edit-scripts-with-your-favorite-editor/"}}