{"data":{"site":{"siteMetadata":{"title":"Gerald is coming","subtitle":"Leave me alone","copyright":"© All rights reserved.","menu":[{"label":"Articles","path":"/"},{"label":"About me","path":"/about/"}],"author":{"name":"Gerald L.","email":"i@gerald.top","telegram":"gera2ld","twitter":"gera2ld","github":"gera2ld","rss":""}}},"markdownRemark":{"id":"42f35c60-a583-5016-945b-56d1c0bbcc26","html":"<p>Violentmonkey (\"us\", \"we\", or \"our\") operates the <a href=\"/get-it/\">Violentmonkey extension</a> (the \"Service\").</p>\n<p>This page informs you of our policies regarding the collection, use and disclosure of Personal Information when you use our Service.</p>\n<p>We will not use or share your information with anyone except as described in this Privacy Policy. Privacy Policy created by TermsFeed for Violentmonkey.</p>\n<p>We use your Personal Information for providing and improving the Service. By using the Service, you agree to the collection and use of information in accordance with this policy. Unless otherwise defined in this Privacy Policy, terms used in this Privacy Policy have the same meanings as in our Terms and Conditions, accessible in Violentmonkey.</p>\n<h3>Information Collection And Use</h3>\n<p>While using our Service, we may ask you to provide us with certain personally identifiable information that can be used to contact or identify you.</p>\n<p>Currently we do not collect any of your personal data.</p>\n<h3>Service Providers</h3>\n<p>We may employ third party companies and individuals to facilitate our Service, to provide the Service on our behalf, to perform Service-related services or to assist us in analyzing how our Service is used.</p>\n<p>These third parties have access to your Personal Information only to perform these tasks on our behalf and are obligated not to disclose or use it for any other purpose.</p>\n<p>We use popular cloud storage services to synchronize extension data after your authorization. Your script code and setting may be synced to your cloud service directly, without transit to other servers.</p>\n<h3>Security</h3>\n<p>The security of your Personal Information is important to us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. Extension data is stored locally at most times, only synchronized to cloud storages after your authorization. While we try to protect your Personal Information, we cannot guarantee its absolute security.</p>\n<h3>Links To Other Sites</h3>\n<p>Our Service may contain links to other sites that are not operated by us. If you click on a third party link, you will be directed to that third party's site. We strongly advise you to review the Privacy Policy of every site you visit.</p>\n<p>We have no control over, and assume no responsibility for the content, privacy policies or practices of any third party sites or services.</p>\n<h3>Changes To This Privacy Policy</h3>\n<p>We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.</p>\n<p>You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.</p>\n<h3>Contact Us</h3>\n<p>If you have any questions about this Privacy Policy, please contact us.</p>","frontmatter":{"title":"Privacy Policy","date":"2017-11-21T12:43:17.000Z","description":""}}},"pageContext":{"slug":"/privacy"}}